In [15]:
import pandas as pd
import duckdb as db

# establish a connection to the database
con = db.connect(database='patent_database', read_only=False)

In [7]:
# Read the data from the CSV file
patstat_data = pd.read_csv('Export_Patstat_Test_16092024.csv', sep=';')
firm_names_data = pd.read_excel('Firm_names_Refinitiv.xls')

In [23]:
# Create the tables in the database
con.sql("CREATE TABLE IF NOT EXISTS patstat_data AS SELECT pat_publn_id, han_name, person_name, psn_name FROM patstat_data")
con.sql("CREATE TABLE IF NOT EXISTS firm_names_data AS SELECT name, ISIN FROM firm_names_data")

In [44]:
con.sql("SELECT * FROM patstat_data WHERE han_name LIKE '%Siemens AG%' OFFSET 300").fetchdf()

     pat_publn_id    han_name person_name psn_name
0       322747145  Siemens AG  Siemens AG  SIEMENS
1       322747219  Siemens AG  Siemens AG  SIEMENS
2       322748120  Siemens AG  Siemens AG  SIEMENS
3       322748342  Siemens AG  Siemens AG  SIEMENS
4       322748368  Siemens AG  Siemens AG  SIEMENS
..            ...         ...         ...      ...
436     386429829  Siemens AG  Siemens AG  SIEMENS
437     386430209  Siemens AG  Siemens AG  SIEMENS
438     386430860  Siemens AG  Siemens AG  SIEMENS
439     386431224  Siemens AG  Siemens AG  SIEMENS
440     386431283  Siemens AG  Siemens AG  SIEMENS

[441 rows x 4 columns]

In [45]:
con.sql("SELECT COUNT(*) FROM firm_names_data").fetchdf()

   count_star()
0         14486